/* -------------------------------------------------------------------------- */
/*                                  Function                                  */
/* -------------------------------------------------------------------------- */

// 함수란?
// 프로그래밍 언어의 함수는 일련의 과정을 문(statement)으로 구현하고 코드 블록으로 감싸서 하나의 실행 단위로 정의한 것이다.
function add(x, y) {
  return x + y;
}
add(2, 5); // 7
// 프로그래밍 언어의 함수도 입력을 받아서 출력을 보낸다.
// 이 때 함수 내부로 입력을 전달받는 변수를 매개변수(parameter), 입력을 인수(argument), 출력을 반환 값(return value)라고 한다.
// 함수는 값이며 특정 함수를 구별하기 위해 식별자인 함수 이름을 사용할 수 있다.

// 함수는 함수 정의(function definition)를 통해 생성한다.
